{
  "backend/main.mo": "Main backend actor implementing user profiles, friends management, chat messaging, and video call session tracking with role-based access control using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (authentication, friends list, chat, video calling, UI design) to their corresponding files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files including components, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode color tokens for a warm, friendly palette with coral, mint, and soft yellow accents.",
  "frontend/index.html": "HTML entry point for the Friend Connect application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component orchestrating authentication, profile setup, friends list, chat window, and video call interface with state management for call sessions and friend selection.",
  "frontend/src/components/AddFriendDialog.tsx": "Modal dialog component for adding friends by entering and validating Principal ID with form submission and error handling.",
  "frontend/src/components/CallNotification.tsx": "Incoming call notification card component displaying caller information with accept and decline buttons (currently placeholder without active signaling).",
  "frontend/src/components/ChatWindow.tsx": "Displays a chat interface with message history, input field, and video call button for a selected friend. Handles sending messages and auto-scrolling to latest messages.",
  "frontend/src/components/FriendsList.tsx": "Shows a scrollable list of friends with their online status, avatars, and usernames. Includes an add friend dialog and highlights the selected friend.",
  "frontend/src/components/Layout.tsx": "Provides the main app layout with header (logo, title, login button), main content area, and footer with branding and attribution links.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button that toggles Internet Identity authentication and displays loading state during authentication.",
  "frontend/src/components/MessageBubble.tsx": "Displays individual chat messages with different styling for sent vs received messages, including timestamp and text content.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time users to set their username, blocking interaction until profile is created.",
  "frontend/src/components/VideoCallInterface.tsx": "Full-screen video call UI with remote video (main), local video (PiP), and controls for mute, video toggle, and ending calls using WebRTC.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend canister interactions including user profiles, friends list, chat history, messaging, and call signaling with automatic cache invalidation.",
  "frontend/src/hooks/useWebRTC.ts": "Custom hook managing WebRTC peer connections for video calls, handling local/remote media streams, ICE connection state, and integrating with backend call signaling.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, plus utility classes for video mirroring.",
  "frontend/src/lib/toaster-provider.tsx": "Wrapper component that configures and renders the Sonner toast notification system with top-right positioning and rich colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom OKLCH color system, container settings, border radius variables, animations, and typography/container-queries plugins.",
  "project_state.json": "Project state file for 'Friend Connect', a social communication app with user authentication, friends management, text chat, and video calling features. Contains completed features (authentication, friends list, chat UI, video UI, design) and pending backend features (message storage and call signaling)."
}